vik/app/views/students/detail.html.erb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
        <% @likes.each do |like| %>
        <% offered_company = Company.find_by(id: like.post_id) %>