vik/app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"
---
  def select
    @companies = Company.all

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 8]]
---
  def detail
    @companies = Company.find_by(id: params[:id])
    @likes = Like.where(post_id: @companies.id)

INSERT INTO "companies" ("c_name", "c_email", "created_at", "updated_at", "c_password") VALUES (?, ?, ?, ?, ?)  [["c_name", "株式会社vi kosen"], ["c_email", "kosehiro@vi_kosen.com"], ["created_at", "2017-12-30 12:46:19.387790"], ["updated_at", "2017-12-30 12:46:19.387790"], ["c_password", "kosehiro"]]
---
  def create
    if session[:companies_id] != nil
      flash[:notice] = "すでにログインしています"
      redirect_to ("/companies/redirect")
    end
    @companies = Company.new(
        c_name: params[:c_name],
        c_email: params[:c_email],
        c_password: params[:c_password],
        c_url: params[:c_url],
        c_tel: params[:c_tel],
        c_content: params[:c_content],
        c_industry: params[:c_industry],
        c_place: params[:c_place],
        image: "default_user.png",
    )
    if @companies.save

SELECT  "companies".* FROM "companies" WHERE "companies"."c_email" = ? AND "companies"."c_password" = ? LIMIT ?  [["c_email", "test2"], ["c_password", "test2"], ["LIMIT", 1]]
---
  def login
    if session[:companies_id] != nil
      flash[:notice] = "すでにログインしています"
      redirect_to ("/companies/redirect")
    end
    @companies = Company.find_by(c_email: params[:c_email], c_password: params[:c_password])

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "companies" SET "c_email" = ?, "c_tel" = ?, "c_industry" = ?, "c_place" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["c_email", "kose@kutc.com"], ["c_tel", "000-1234-5678"], ["c_industry", "IT"], ["c_place", "東京都"], ["updated_at", "2018-01-02 07:10:11.222108"], ["id", 8]]
---
  def update
    if session[:companies_id] == nil
      @error_message = "ログインが必要です"
      render("login_form")
    end
    @companies = Company.find_by(id: params[:id])
    @companies.c_name = params[:c_name]
    @companies.c_email = params[:c_email]
    @companies.c_password = params[:c_password]
    @companies.c_tel = params[:c_tel]
    @companies.c_industry = params[:c_industry]
    @companies.c_place = params[:c_place]
    @companies.save

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def edit_top
    if session[:companies_id] == nil
      @error_message = "ログインが必要です"
      render("login_form")
    end
    @companies = Company.find_by(id: params[:id])

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def edit_bottom
    if session[:companies_id] == nil
      @error_message = "ログインが必要です"
      render("login_form")
    end
    @companies = Company.find_by(id: params[:id])

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "companies" SET "c_url" = ?, "c_content" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["c_url", "https://www.vi_kosen.com"], ["c_content", "一人一人が活躍できる社会を創る"], ["updated_at", "2018-01-02 08:59:39.488228"], ["id", 8]]
---
  def update_bottom
    if session[:companies_id] == nil
      @error_message = "ログインが必要です"
      render("login_form")
    end
    @companies = Company.find_by(id: params[:id])
    @companies.c_url = params[:c_url]
    @companies.c_content = params[:c_content]
    @companies.save

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "companies" SET "image" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["image", "9.jpg"], ["updated_at", "2018-01-07 05:55:29.076102"], ["id", 9]]
---
  def update_img
    if session[:companies_id] == nil
      @error_message = "ログインが必要です"
      render("login_form")
    end
    @companies = Company.find_by(id: params[:id])
    # 画像のアップロード用
    if params[:image]
      @companies.image = "#{@companies.id}.jpg"
      image = params[:image]
      File.binwrite("public/company_images/#{@companies.image}",image.read)
    end
    if @companies.save