vik/app/controllers/likes_controller.rb

  def create
    @like = Like.new(
        user_id: params[:student_id],
        post_id: session[:companies_id]
    )
    @like.save
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_id", 8], ["created_at", "2018-01-05 06:08:22.237238"], ["updated_at", "2018-01-05 06:08:22.237238"]]