vik/app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def select
    @students = Student.all

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 1]]
---
  def detail
    @students = Student.find_by(id: params[:id])
    @likes = Like.where(user_id: @students.id)

INSERT INTO "students" ("s_name", "s_email", "s_school", "s_password", "s_image", "created_at", "updated_at", "s_grade") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    if session[:students_id] != nil
      flash[:notice] = "すでにログインしています"
      redirect_to ("/students/redirect")
    end
    @students = Student.new(
        s_name: params[:s_name],
        s_email: params[:s_email],
        s_password: params[:s_password],
        s_school: params[:s_school],
        s_grade: params[:s_grade],
        image: "default_user.png",
        )
    if @students.save

SELECT  "students".* FROM "students" WHERE "students"."s_email" = ? AND "students"."s_password" = ? LIMIT ?  [["s_email", "g21125@rcs.kutc.jp"], ["s_password", "koko"], ["LIMIT", 1]]
---
  def login
    if session[:students_id] != nil
      flash[:notice] = "すでにログインしています"
      redirect_to ("/students/redirect")
    end
    @students = Student.find_by(s_email: params[:s_email], s_password: params[:s_password])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "s_grade" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["s_grade", "4年"], ["updated_at", "2018-01-04 08:08:16.775114"], ["id", 1]]
---
  def update
    if session[:students_id] == nil
      @error_message = "ログインが必要です"
      render("students/login_form")
    end
    @students = Student.find_by(id: params[:id])
    @students.s_name = params[:s_name]
    @students.s_email = params[:s_email]
    @students.s_password = params[:s_password]
    @students.s_school = params[:s_school]
    @students.s_grade = params[:s_grade]
    @students.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit_top
    if session[:students_id] == nil
      @error_message = "ログインが必要です"
      render("students/login_form")
    end
    @students = Student.find_by(id: params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "image" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["image", "1.jpg"], ["updated_at", "2018-01-04 08:31:29.288333"], ["id", 1]]
---
  def update_img
    if session[:students_id] == nil
      @error_message = "ログインが必要です"
      render("students/login_form")
    end
    @students = Student.find_by(id: params[:id])
    # 画像のアップロード用
    if params[:image]
      @students.image = "#{@students.id}.jpg"
      image = params[:image]
      File.binwrite("public/student_images/#{@students.image}",image.read)
    end
    if @students.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "students" SET "pdf" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["pdf", "2.pdf"], ["updated_at", "2018-01-04 09:13:33.064469"], ["id", 2]]
---
  def update_pdf
    if session[:students_id] == nil
      @error_message = "ログインが必要です"
      render("students/login_form")
    end
    @students = Student.find_by(id: params[:id])
    # 画像のアップロード用
    if params[:pdf]
      @students.pdf = "#{@students.id}.pdf"
      pdf = params[:pdf]
      File.binwrite("public/student_pdf/#{@students.pdf}",pdf.read)
    end
    if @students.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @students = Student.find_by(id: params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "s_live_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["s_live_id", "58WB1bdYx5zc9Byr"], ["updated_at", "2018-01-05 14:03:51.619854"], ["id", 1]]
---
  def update_s_live_id
    if session[:students_id] == nil
      @error_message = "ログインが必要です"
      render("students/login_form")
    end
    @students = Student.find_by(id: params[:id])
    @students.s_live_id = params[:s_live_id]
    @students.save