vik/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def select
    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def detail
    @users = User.find_by(id: params[:id])

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "kosehiro"], ["email", "kosehiro@app"], ["created_at", "2017-12-20 18:16:16.819629"], ["updated_at", "2017-12-20 18:16:16.819629"]]
---
  def create
    @user = User.new(name: params[:name], email: params[:email])
    if @user.save