vik/app/views/companies/detail.html.erb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <% @likes.each do |like| %>
          <% offer_student = Student.find_by(id: like.user_id) %>